<html>
<body>
    <h1>Pandas Library</h1>
    <ol>
        <li>Handling of data</li>
        <li>Alignment and indexing</li>
        <li>Multiple file formats supported</li>
    </ol>    
</body>    
</html>

<h2>Import the Pandas library with alias pd</h2>

In [5]:
import pandas as pd

In [6]:
help(pd)

Help on package pandas:

NAME
    pandas

DESCRIPTION
    pandas - a powerful data analysis and manipulation library for Python
    =====================================================================

    **pandas** is a Python package providing fast, flexible, and expressive data
    structures designed to make working with "relational" or "labeled" data both
    easy and intuitive. It aims to be the fundamental high-level building block for
    doing practical, **real world** data analysis in Python. Additionally, it has
    the broader goal of becoming **the most powerful and flexible open source data
    analysis / manipulation tool available in any language**. It is already well on
    its way toward this goal.

    Main Features
    -------------
    Here are just a few of the things that pandas does well:

      - Easy handling of missing data in floating point as well as non-floating
        point data.
      - Size mutability: columns can be inserted and deleted from DataFrame and
        higher dimensional objects
      - Automatic and explicit data alignment: objects can be explicitly aligned
        to a set of labels, or the user can simply ignore the labels and let
        `Series`, `DataFrame`, etc. automatically align the data for you in
        computations.
      - Powerful, flexible group by functionality to perform split-apply-combine
        operations on data sets, for both aggregating and transforming data.
      - Make it easy to convert ragged, differently-indexed data in other Python
        and NumPy data structures into DataFrame objects.
      - Intelligent label-based slicing, fancy indexing, and subsetting of large
        data sets.
      - Intuitive merging and joining data sets.
      - Flexible reshaping and pivoting of data sets.
      - Hierarchical labeling of axes (possible to have multiple labels per tick).
      - Robust IO tools for loading data from flat files (CSV and delimited),
        Excel files, databases, and saving/loading data from the ultrafast HDF5
        format.
      - Time series-specific functionality: date range generation and frequency
        conversion, moving window statistics, moving window linear regressions,
        date shifting and lagging, etc.

PACKAGE CONTENTS
    _config (package)
    _libs (package)
    _typing
    _version
    api (package)
    arrays (package)
    compat (package)
    conftest
    core (package)
    errors (package)
    io (package)
    plotting (package)
    testing
    tests (package)
    tseries (package)
    util (package)

SUBMODULES
    _hashtable
    _lib
    _tslib
    offsets

FUNCTIONS
    __getattr__(name)

DATA
    IndexSlice = <pandas.core.indexing._IndexSlice object>
    NaT = NaT
    __docformat__ = 'restructuredtext'
    __git_version__ = '62a87bf4a2af02a8d3bc271ad26e5994292b8e6a'
    describe_option = <pandas._config.config.CallableDynamicDoc object>
    get_option = <pandas._config.config.CallableDynamicDoc object>
    options = <pandas._config.config.DictWrapper object>
    reset_option = <pandas._config.config.CallableDynamicDoc object>
    set_option = <pandas._config.config.CallableDynamicDoc object>

VERSION
    0.25.3

FILE
    /opt/anaconda3/lib/python3.7/site-packages/pandas/__init__.py

Here we imported the pandas library and saw its description.

<h4>Creating a Series<h4>

In [7]:
actor1 = pd.Series({"Name" : "Shartner",
         "Character" : "Kirk",
         "Salary" : "5000"})

Here we created a dictionary and converted it into panda series.

In [8]:
actor1

Name         Shartner
Character        Kirk
Salary           5000
dtype: object

Output.

In [9]:
actor2 = pd.Series({"Name" : "Nimoy",
         "Character" : "Spock",
         "Salary" : "1250"})
actor3 = pd.Series({"Name" : "Stewart",
         "Character" : "Picard",
         "Salary" : "100000"})

In [10]:
actor2, actor3

(Name         Nimoy
 Character    Spock
 Salary        1250
 dtype: object, Name         Stewart
 Character     Picard
 Salary        100000
 dtype: object)

Another two actors.

In [11]:
print(actor1)
print(actor2)
print(actor3)

Name         Shartner
Character        Kirk
Salary           5000
dtype: object
Name         Nimoy
Character    Spock
Salary        1250
dtype: object
Name         Stewart
Character     Picard
Salary        100000
dtype: object

Here we use the print statement.

In [12]:
print (actor1["Character"])
print (actor2["Character"])
print (actor3["Character"])

Kirk
Spock
Picard

Output only the characters.

<h4>Using a list to store a series<h4>

In [13]:
actor = [actor1, actor2, actor3]

In [14]:
for i in actor:
    print (i["Character"])

Kirk
Spock
Picard

Here we print all the characters.

In [15]:
df = pd.DataFrame(actor)

In [16]:
df

       Name Character  Salary
0  Shartner      Kirk    5000
1     Nimoy     Spock    1250
2   Stewart    Picard  100000

Here we made a DataFrame.

In [17]:
df.head(2)

       Name Character Salary
0  Shartner      Kirk   5000
1     Nimoy     Spock   1250

Using the head method to print a specific number of rows.

In [18]:
df = pd.DataFrame(actor, index = ["Original", "Original", "Next Generation"])

In [19]:
df

                     Name Character  Salary
Original         Shartner      Kirk    5000
Original            Nimoy     Spock    1250
Next Generation   Stewart    Picard  100000

Index attribute.

In [20]:
df2 = pd.DataFrame()
# print(df2)
# print(df3)
for a in actor:
    df2 = df2.append(a, ignore_index = True)
    

# df4 = df2.append(actor[1], ignore_index = True)
# df5 = df3.append(actor[1], ignore_index = True)
# print(df2)  # empty
# print(df3)  # first actor
# print(df4)  # second actor
# print(df5)  # first and second

In [21]:
df2

  Character      Name  Salary
0      Kirk  Shartner    5000
1     Spock     Nimoy    1250
2    Picard   Stewart  100000

New DataFrame, eww.

In [22]:
df2.loc[2]

Character     Picard
Name         Stewart
Salary        100000
Name: 2, dtype: object

Loc method.

In [23]:
df.loc[["Original"]]

              Name Character Salary
Original  Shartner      Kirk   5000
Original     Nimoy     Spock   1250

In [24]:
df.loc[["Original"], ["Name"]]

              Name
Original  Shartner
Original     Nimoy

df.loc methods used here

In [28]:
df.T

           Original Original Next Generation
Name       Shartner    Nimoy         Stewart
Character      Kirk    Spock          Picard
Salary         5000     1250          100000

In [29]:
df

                     Name Character  Salary
Original         Shartner      Kirk    5000
Original            Nimoy     Spock    1250
Next Generation   Stewart    Picard  100000

In [31]:
df=df.T
df

                     Name Character  Salary
Original         Shartner      Kirk    5000
Original            Nimoy     Spock    1250
Next Generation   Stewart    Picard  100000

Transparency